## JOINS

Topics covered in this notebook:

- `AS`
- `INNTER JOINS`
- `OUTER JOINS`
- `FULL JOINS`
- `UNIONS`

### Libraries and function setup to perform queries

In [1]:
# Libraries
import pandas as pd
import sqlite3

cnx = sqlite3.connect('./data/jobs.db')

# Definimos la función para hacer queries.
def sql_query(query):
    return pd.read_sql(query, cnx)

### `AS`

Creates an alias for a column or result.

Note: aliases are only created at the end

In [4]:
query = """
SELECT Name, SUM(Salary) AS total_salary
FROM jobs
GROUP BY Name
"""
sql_query(query)

        Name  total_salary
0      Aaron       2388324
1    Abigail        523376
2       Adam       2300153
3     Adrian        820912
4    Adriana        169895
..       ...           ...
658  Yolanda        411244
659   Yvette        165454
660   Yvonne        373081
661  Zachary       2080021
662      Zoe        139969

[663 rows x 2 columns]

One typicall error at the begining is to perform alias at end in HAVING.

Alias is assigned at the very end. Therefore, the above code should not work and it is incorrect.

In [18]:
query = """
SELECT Name, SUM(Salary) AS total_salary
FROM jobs
GROUP BY Name
HAVING total_salary < 40000
"""
sql_query(query)

      Name  total_salary
0    Alvin         36155
1  Belinda         38383
2  Gilbert         30244
3     Jake         30059
4  Kirsten         34761
5     Leon         35273
6     Nina         33505
7    Patty         37318

The correct way would be as follows.

In [20]:
query = """
SELECT Name, SUM(Salary) AS total_salary
FROM jobs
GROUP BY Name
HAVING SUM(Salary) < 40000
"""
sql_query(query)

      Name  total_salary
0    Alvin         36155
1  Belinda         38383
2  Gilbert         30244
3     Jake         30059
4  Kirsten         34761
5     Leon         35273
6     Nina         33505
7    Patty         37318

### `JOINS`

Allow us to combine information from multiple tables together.

The main reason for the different JOIN types is to decide how to deal with information only present in one of the joined tables.

### Until now we were playing with a database with only one table, but in the real world we will have many in same database.

Let´s view all the tables present

In [39]:
cnx_logins_registration = sqlite3.connect('./data/logins_registrations.db')
crsr = cnx_logins_registration.cursor()

# Definimos la función para hacer queries.
def sql_query_joins(query):
    return pd.read_sql(query, cnx_logins_registration)

In [40]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

registrations
logins

Registrations Table

In [41]:
query = """
SELECT *
FROM registrations

"""
sql_query_joins(query)

   reg_id    Name
0       1    Pepe
1       2    Luis
2       3  Amelia
3       4  Susana

Logins Table

In [42]:
query = """
SELECT *
FROM logins

"""
sql_query_joins(query)

   log_id      Name
0       1     Laura
1       2      Pepe
2       3  Fernando
3       4      Luis

#### `INNER JOIN`

<img src="https://res.cloudinary.com/pym/image/upload/c_scale,f_auto,q_auto,w_258/articles/2019/sql/INNER_JOIN">

In [43]:
query = """
SELECT *
FROM registrations AS r
INNER JOIN logins AS l
ON r.Name = l.Name

"""
sql_query_joins(query)

   reg_id  Name  log_id  Name
0       1  Pepe       2  Pepe
1       2  Luis       4  Luis

#### `FULL JOIN`

<img src="https://res.cloudinary.com/pym/image/upload/c_scale,f_auto,q_auto,w_258/articles/2019/sql/FULL_JOIN">

#### `LEFT JOIN`

<img src="https://res.cloudinary.com/pym/image/upload/c_scale,f_auto,q_auto,w_258/articles/2019/sql/LEFT_JOIN">

#### `RIGHT JOIN`

<img src="https://res.cloudinary.com/pym/image/upload/c_scale,f_auto,q_auto,w_258/articles/2019/sql/RIGHT_JOIN">